abicloud_WS/examples/createResponse.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:mdo="http://schemas.wiseman.dev.java.net/metadata/messagetypes" xmlns:mex="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsman="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmeta="http://schemas.dmtf.org/wbem/wsman/1/wsman/version1.0.0.a/default-addressing-model.xsd" xmlns:wxf="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:xs="http://www.w3.org/2001/XMLSchema">
	<env:Header>
		<wsa:Action xmlns:ns11="http://schemas.dmtf.org/ovf/envelope/1" xmlns:ns12="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_ResourceAllocationSettingData" xmlns:ns13="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_VirtualSystemSettingData" xmlns:ns14="http://schemas.dmtf.org/wbem/wscim/1/common" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/CreateResponse</wsa:Action>
		<wsa:MessageID xmlns:ns11="http://schemas.dmtf.org/ovf/envelope/1" xmlns:ns12="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_ResourceAllocationSettingData" xmlns:ns13="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_VirtualSystemSettingData" xmlns:ns14="http://schemas.dmtf.org/wbem/wscim/1/common" env:mustUnderstand="true">uuid:6dbde011-1a1b-45bb-aaef-8185d980dbc1</wsa:MessageID>
		<wsa:RelatesTo xmlns:ns11="http://schemas.dmtf.org/ovf/envelope/1" xmlns:ns12="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_ResourceAllocationSettingData" xmlns:ns13="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_VirtualSystemSettingData" xmlns:ns14="http://schemas.dmtf.org/wbem/wscim/1/common">uuid:092fca9f-00d1-4f81-bc3f-fbb4e37efd8b</wsa:RelatesTo>
		<wsa:To xmlns:ns11="http://schemas.dmtf.org/ovf/envelope/1" xmlns:ns12="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_ResourceAllocationSettingData" xmlns:ns13="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_VirtualSystemSettingData" xmlns:ns14="http://schemas.dmtf.org/wbem/wscim/1/common" env:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
	</env:Header>
	<env:Body>
		<wxf:ResourceCreated xmlns:ns11="http://schemas.dmtf.org/ovf/envelope/1" xmlns:ns12="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_ResourceAllocationSettingData" xmlns:ns13="http://schemas.dmtf.org/wbem/wscim/1/cim-schema/2/CIM_VirtualSystemSettingData" xmlns:ns14="http://schemas.dmtf.org/wbem/wscim/1/common">
			<wsa:Address env:mustUnderstand="true">http://localhost:8080/virtualAppliance/</wsa:Address>
			<wsa:ReferenceParameters>
				<wsman:ResourceURI>http://schemas.dmtf.org/ovf/envelope/1/virtualApplianceService/virtualApplianceResource</wsman:ResourceURI>
				<wsman:SelectorSet>
					<wsman:Selector Name="type">vBox</wsman:Selector>
					<wsman:Selector Name="id">3</wsman:Selector>
				</wsman:SelectorSet>
			</wsa:ReferenceParameters>
		</wxf:ResourceCreated>
	</env:Body>
</env:Envelope>
